class Constants:
    #色の定義
    WHITE  = (255,255,255)
    BLACK  = (  0,  0,  0)
    RED    = (255,  0,  0)
    YELLOW = (255,224,  0)
    
    #コースの定義
    #道路のカーブを作る基になるデータ
    DATA_LR = [
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 2, 3, 2, 1, 0, 2, 4,
        2, 4, 2, 0, 0, 0,-2,-2,-4,-4,
        -2,-1, 0, 0, 0, 0, 0, 0, 0
    ]
    #道路の起伏を作る基になるデータ
    DATA_UD = [
        0, 0, 1, 2, 3, 2, 1, 0,-2,-4,
        -2, 0, 0, 0, 0, 0,-1,-2,-3,-4,
        -3,-2,-1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0,-3, 3, 0,-6, 6, 0
    ]
    CLEN = len(DATA_LR)  #左右のデータの要素数を代入した定数



if __name__ == '__main__':
    const = Constants()
    print(const.WHITE)
    print(const.CLEN)